---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CornerMullionsNeighborsMustBeTangent
source: html/728ebd90-3245-badd-bd5a-31b96dced88c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CornerMullionsNeighborsMustBeTangent Property

Corner Mullions must be placed at a location that can have neighboring Panels that are not tangent. With the exception of Wall Join locations, Corner Mullions are not currently supported on the external boundaries of Curtain elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CornerMullionsNeighborsMustBeTangent { get; }
```